#13-燕宗振-Py201406062

#第一题答案

"""
IDLE的shell是直接输出的一句代表一条命令，不可产生py文件
编辑器是一种以代码的形式编辑并且保存后再使用run module运行的工具，
可用于py文件的保存
"""

#第二答案
"""
编辑器中对于已经编好的代码，进行保存后，按住快捷键F5
或者找到工具栏Run-run module，此时便可运行代码
"""
#第三题答案
"""
注释有几种类型：单行注释使用#；
注释多行使用 ' ',"",""" """
"""
#演示
'a'
"b"
"""
c
"""

#第四题答案
"""
对于变量赋值使用=进行操作
如下演示
"""
a = 1

#第五题答案
"""
输出用的函数叫print()
如下演示
"""
b = 2
print(b)

#第六题答案
#了解关键字 下面关键字演示
import keyword
keyword.kwlist
print(keyword.kwlist)
"""
变量顾名思义可变的量：
变量的命名
c = 1
1 的名字叫 c
c 便是变量
"""

#第七题异常
"""
异常就是在程序运行过程中出现的不正常的现象 出现报错
演示如下
"""
abb = 1
print(abb1)  #此时会出现NameError 未定义名字异常

#附加题
#-5-256一直在内存里现成的不用再开内存
